{"payload":
[
 {
  "Otofusion Param ID": 100,
  "PGN": 0,
  "PG Label": "Torque\/Speed Control 1",
  "Multipacket": "No",
  "Transmission Rate": "To engine: Control Purpose dependent or 10 ms\r\nTo retarder: 50 ms",
  "SP Position in PG": "4",
  "SPN": 518,
  "In Data?": 7163181,
  "SP Label": "Engine Requested Torque\/Torque Limit",
  "SP Description": "Parameter provided to the engine or retarder in the torque\/speed control message for controlling or limiting the output torque.\r\n\r\nRequested torque to the engine is measured in indicated torque as a percentage of reference engine torque (see the engine configuration message, PGN 65251).  This is the engine torque at which the engine is expected to operate if the torque control mode is active or the engine torque which the engine is not expected to exceed if the torque limit mode is active.\r\n\r\nZero torque can be requested which implies zero fuel and, according to Figures SPN512_A and SPN512_B, the engine will not be allowed to stall.  The actual engine percent torque (SPN 513) should be zero and the engine should decelerate until the low idle governor kicks in, at which time the actual engine percent torque will be calculated as shown in Figures SPN512_A and SPN512_B and the engine torque mode bits (SPN 899) should be equal to 0000b - Low Idle Governor.\r\n\r\nRequested torque to the retarder is measured in indicated torque as a percentage of reference retarder torque (see the retarder configuration message,  PGN 65249).  The logic used in enabling or disabling the retarder is based on the override control mode priority bits (SPN 897).\r\n\r\nA zero torque request to the retarder is a disable request, and is used by a J1939 node to prevent the retarder from being activated by other combinations of inputs outside of J1939 commands. The Torque Limit Mode is commonly used for this purpose.",
  "SP Length": "1 byte",
  "Resolution": "1 %\/bit",
  "Offset": "-125 %",
  "Units": "%",
  "Data Range": "-125 to 125 %"
 },
 {
  "Otofusion Param ID": 101,
  "PGN": 256,
  "PG Label": "Transmission Control 1",
  "Multipacket": "No",
  "Transmission Rate": "System dependent; either 50 ms as needed for active control, or as a continuous 50 ms periodic broadcast.",
  "SP Position in PG": "3",
  "SPN": 525,
  "In Data?": 1332033,
  "SP Label": "Transmission Requested Gear",
  "SP Description": "Gear requested by the operator, ABS, or engine.\r\n\r\nNegative values are reverse gears, positive values are forward gears, zero is neutral, parameter specific indicators are listed below.\r\n\r\nParameter specific values for this parameter are as follows:\r\nFDh = Hold current gear\r\nFCh = Forward Drive Position\r\nFBh = 'Park' position\r\nFAh = Forward 'Low' position\r\nF9h = Upshift 1 gear from current position\r\nF8h = Upshift 2 gears from current position\r\nF7h = Downshift 1 gear from current position\r\nF6h = Downshift 2 gears from current position\r\nF5h = D-1: 1st forward selector position referenced from 'Drive'\r\nF4h = D-2: 2nd forward selector position referenced from 'Drive'\r\nF3h = D-3: 3rd forward selector position referenced from 'Drive'\r\nF2h = D-4: 4th forward selector position referenced from 'Drive'\r\nF1h = D-5: 5th forward selector position referenced from 'Drive'\r\nF0h = D-6: 6th forward selector position referenced from 'Drive'\r\nEFh = D-7: 7th forward selector position referenced from 'Drive'\r\nEEh = Between two shift selector positions (if detail is unknown)\r\nEDh = Between two reverse shift selector positions\r\nECh = Between two forward shift selector positions\r\nEBh = Between D-7 and D-6 shift selector positions\r\nEAh = Between D-6 and D-5 shift selector positions\r\nE9h = Between D-5 and D-4 shift selector positions\r\nE8h = Between D-4 and D-3 shift selector positions\r\nE7h = Between D-3 and D-2 shift selector positions\r\nE6h = Between D-2 and D-1 shift selector positions\r\nE5h = Between D-1 and 'Drive' shift selector positions\r\nE4h = Between 'Drive' and 'Neutral' shift selector positions\r\nE3h = Between 'Neutral' and 'Reverse' shift selector positions\r\nE2h = Between 'Reverse' and 'Park' shift selector positions\r\nE1h = Press of momentary button to reselect current position\r\nE0h = Position unknown and\/or no buttons pressed\r\nDFh = Reverse Selector Position\r\n\r\nDEh to BEh = Reserved\r\n3Ch to 00h = Reserved\r\n\r\nForward selector position from drive (F5h to EFh) – Indicates shift selector position in reference to the 'Drive' position on the selector.  It is possible that the shift selector software may not know the number of forward ranges.  The shift selector may identify the position selected by the operator while the transmission ECU determines what range or gear that represents.  If there is a digital display, the transmission ECU would communicate what is to be displayed via another message such as ETC#2 or ETC#7.\r\n\r\nFor example:  Consider a vehicle with a 5-speed automatic transmission with the shift lever on the column. Suppose that shift selector has a limited number of positions, such that having positions for D-4-3-2-1 is not an option. For this example, assume there are only have enough lever positions for D-3-2-1. Pulling the lever into \"D\" will put the transmission in 5th (highest gear).  It is desired that pulling the lever to the physical \"3\" position will limit the transmission to a maximum range of 3rd gear.\r\n\r\nWhen the selector is pulled down into \"3\", the shifter selector itself has no way of correlating this physical lever position to the desired gear; it would have to be calibrated with software to tell it this information. If not calibrated, the shift selector cannot directly command the transmission to go to 3rd gear; it only knows it's one notch below drive.\r\n\r\nHowever, if \"D-1\" (lever position, as opposed to desired gear) is broadcast by the selector, the transmission ECU can receive this and then make the determination of what range is desired. The benefit is that no specific calibration of the shift selector is required. \r\n\r\nBetween selector positions (EEh to E2h) – Indicates the shift selector is not in an appropriate position.  If a lever-type shift selector with a mechanical display is stuck between detents, it may appear to the operator that it is in the desired position when in fact it is not. The shift selector may be capable of reporting only that it is between positions or that it is between forward or reverse positions. If known, the transmission ECU may respond differently depending on which positions are involved.\r\n\r\nReselect current position (E1h) - If the TC1 message continues to send the position last selected, then a capability to reselect the same position is required.  For example:  If a 'Neutral to Drive' shift is selected and that shift is inhibited (say for high engine speed), it may be necessary for the operator to reselect 'Drive' after the inhibit conditions pass in order for the transmission ECU to honor the request.\r\n\r\nPosition unknown and\/or no buttons pressed (E0h) - A push-button style shift selector with momentary contact buttons may send this indicator after initialization before any buttons are pressed, or before the transmission ECU determines and communicates the initial selection.  This indicator could also be sent between button presses as an alternative to sending the last button press.",
  "SP Length": "1 byte",
  "Resolution": "1 gear value\/bit",
  "Offset": "-125",
  "Units": "gear value",
  "Data Range" : "224 to 253  ,65 to 223 , 0 to 61  "
 },
 {
  "Otofusion Param ID": 102,
  "PGN": 57344,
  "PG Label": "Cab Message 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "1",
  "SPN": 986,
  "In Data?": 88762,
  "SP Label": "Engine Fan 1 Requested Percent Speed",
  "SP Description": "Fan speed of the first or only fan in the system as a ratio of the actual fan drive (current speed) to the fully engaged fan drive (maximum fan speed). A two state fan (off\/on) will use 0% and 100% respectively. A three state fan (off\/intermediate\/on) will use 0%, 50% and 100% respectively. A variable speed fan will use 0% to 100%. Multiple fan systems will use 0 to 100% to indicate the percent cooling capacity being provided. Feedback to this request is provided using the estimated fan speed (see SPN 975). \r\n\r\nNote that the intermediate fan speed of a three state fan will vary with different fan drives, therefore 50% is being used to indicate that the intermediate speed is required from the fan drive. Typically, the first fan in a system will be the fan closest to the radiator. The second fan will be located farthest from the radiator.\r\n\r\nSee SPN 6730 for systems that have two fans.",
  "SP Length": "1 byte",
  "Resolution": "0.4 %\/bit",
  "Offset": "0",
  "Units": "%",
  "Data Range": "0 to 100 %"
 },
 {
  "Otofusion Param ID": 103,
  "PGN": 57344,
  "PG Label": "Cab Message 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "8",
  "SPN": 2596,
  "In Data?": 88762,
  "SP Label": "Selected Maximum Vehicle Speed Limit",
  "SP Description": "User selected maximum vehicle speed.  If one is selected, then this SP must equal one of the maximum vehicle speeds #1-#7 from PGN 64997 - Maximum Vehicle Speed Limit Status. If different maximum vehicle speed requests are present from different devices, the lowest requested value should be used.\r\n\r\n0 is used to indicate that a maximum vehicle speed is not selected.  1 through 7 are valid selectable speed limits. 8 through 250 are not allowed.",
  "SP Length": "1 byte",
  "Resolution": "1 count\/bit",
  "Offset": "0",
  "Units": "count",
  "Data Range": " 0 to 250"
 },
 {
  "Otofusion Param ID": 104,
  "PGN": 61440,
  "PG Label": "Electronic Retarder Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "1.1",
  "SPN": 900,
  "In Data?": 619480,
  "SP Label": "Retarder Torque Mode",
  "SP Description": "State signal which indicates which retarder torque mode is currently generating, limiting, or controlling the torque.  Note that the modes are not in prioritized order. Not all modes may be relevant for a given device.  Some devices may not implement all functions.  For typical priorities refer to Tables SPN518_A to SPN518_B for retarder control.  The data type of this parameter is measured. \r\n\r\nMode 0000b means “No request”: retarder torque = 0 (no braking).\r\n\r\nModes 0001b to 1110b indicate that there is either a torque request or the identified function is currently controlling the retarder: retarder torque may range from 0 (no braking) to the upper limit.",
  "SP Length": "4 bits",
  "Resolution": "1 16 states\/4 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range": "options: 0b0000, 0b0001 -  0b1110"
 },
 {
  "Otofusion Param ID": 105,
  "PGN": 61440,
  "PG Label": "Electronic Retarder Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "4.1",
  "SPN": 1082,
  "In Data?": 619480,
  "SP Label": "Engine Coolant Load Increase",
  "SP Description": "Status of an event, external to the engine, that may increase the nominal temperature of the engine coolant liquid.\r\n\r\n00b = No coolant load increase\r\n01b = Coolant load increase possible\r\n10b = Error\r\n11b = Not available",
  "SP Length": "2 bits",
  "Resolution": "1 4 states\/2 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range": "options: 0b00, 0b01"
 },
 {
  "Otofusion Param ID": 106,
  "PGN": 61441,
  "PG Label": "Electronic Brake Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "3.1",
  "SPN": 575,
  "In Data?": 443556,
  "SP Label": "ABS Off-road Switch",
  "SP Description": "Switch signal which indicates the position of the ABS off-road switch.\r\n\r\n00b = ABS off-road switch passive\r\n01b = ABS off-road switch active\r\n10b = Error\r\n11b = Not available",
  "SP Length": "2 bits",
  "Resolution": "1 4 states\/2 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range" : "options: 0b00, 0b01"
 },
 {
  "Otofusion Param ID": 107,
  "PGN": 61441,
  "PG Label": "Electronic Brake Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "6.1",
  "SPN": 1243,
  "In Data?": 443556,
  "SP Label": "ABS Fully Operational",
  "SP Description": "Signal which indicates whether an ABS system is fully operational or whether its functionality is reduced by a defect or by an intended action (e.g., by activation of an ABS-off-road switch or during special diagnostic procedures).  There are cases where the signal is necessary to fulfill legal regulations for special applications (e.g., switching off integrated retarders).\r\n\r\n00b = Not Fully Operational\r\n01b = Fully Operational\r\n10b = Reserved\r\n11b = Not available",
  "SP Length": "2 bits",
  "Resolution": "1 4 states\/2 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range" : "options: 0b00, 0b01"
 },
 {
  "Otofusion Param ID": 108,
  "PGN": 61444,
  "PG Label": "Electronic Engine Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "Fixed rate of 10 to 50 ms or engine speed dependent",
  "SP Position in PG": "2",
  "SPN": 512,
  "In Data?": 2949283,
  "SP Label": "Driver's Demand Engine - Percent Torque",
  "SP Description": "The requested torque output of the engine by the driver. It is based on input from the following requestors external to the powertrain: operator (via the accelerator pedal), cruise control and\/or road speed limit governor. Dynamic commands from internal powertrain functions such as smoke control, low- and high-speed engine governing; ASR and shift control are excluded from this calculation. The data is transmitted in indicated torque as a percent of the reference engine torque. See PGN 65251 for the engine configuration message. Several status bits are defined separately to indicate the request which is currently being honored. This parameter may be used for shift scheduling.",
  "SP Length": "1 byte",
  "Resolution": "1 %\/bit",
  "Offset": "-125 %",
  "Units": "%",
  "Data Range" : "-125 to 125 %"
 },
 {
  "Otofusion Param ID": 109,
  "PGN": 61444,
  "PG Label": "Electronic Engine Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "Fixed rate of 10 to 50 ms or engine speed dependent",
  "SP Position in PG": "3",
  "SPN": 513,
  "In Data?": 2949283,
  "SP Label": "Actual Engine - Percent Torque",
  "SP Description": "The calculated output torque of the engine.  The data is transmitted in indicated torque as a percent of reference engine torque (see the engine configuration message, PGN 65251).  The engine percent torque value will not be less than zero and it includes the torque developed in the cylinders required to overcome friction.",
  "SP Length": "1 byte",
  "Resolution": "1 %\/bit",
  "Offset": "-125 %",
  "Units": "%",
  "Data Range" : "-125 to 125 %"
 },
 {
  "Otofusion Param ID": 110,
  "PGN": 61444,
  "PG Label": "Electronic Engine Controller 1",
  "Multipacket": "No",
  "Transmission Rate": "Fixed rate of 10 to 50 ms or engine speed dependent",
  "SP Position in PG": "4-5",
  "SPN": 190,
  "In Data?": 2949283,
  "SP Label": "Engine Speed",
  "SP Description": "Actual engine speed which is calculated over a minimum crankshaft angle of 720 degrees divided by the number of cylinders.",
  "SP Length": "2 bytes",
  "Resolution": "0.125 rpm per bit",
  "Offset": "0",
  "Units": "rpm",
  "Data Range" : "0 to 8031.875 rpm"
 },
 {
  "Otofusion Param ID": 111,
  "PGN": 61445,
  "PG Label": "Electronic Transmission Controller 2",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "4",
  "SPN": 523,
  "In Data?": 293650,
  "SP Label": "Transmission Current Gear",
  "SP Description": "The gear currently engaged in the transmission or the last gear engaged while the transmission is in the process of shifting to the new or selected gear.  Transitions toward a destination gear will not be indicated.  Once the selected gear has been engaged then Transmission Current Gear (SPN 523) will reflect that gear.\r\n\r\nNegative values are reverse gears, positive values are forward gears, zero is neutral, 251 (FBh) is park.",
  "SP Length": "1 byte",
  "Resolution": "1 gear value\/bit",
  "Offset": "-125",
  "Units": "gear value",
  "Data Range" : "-125 to 125"
 },
 {
  "Otofusion Param ID": 112,
  "PGN": 61449,
  "PG Label": "Vehicle Dynamic Stability Control 2",
  "Multipacket": "No",
  "Transmission Rate": "10 ms",
  "SP Position in PG": "1-2",
  "SPN": 1807,
  "In Data?": 734123,
  "SP Label": "Steering Wheel Angle",
  "SP Description": "The main operator`s steering wheel angle (on the steering column, not the actual wheel angle).  The vehicle being steered to the left (counterclockwise) results in a positive steering wheel angle.  This is the yaw angle of the steering wheel with the z-axis along the centerline of the steering column. This parameter is defined according to a Z-Up axis system and the sign of the value is in accordance to the right-hand rule, as specified in SAE J670.  As specified in SAE J670, a Z-Up Axis System has positive X directed forward, positive Y to the left, and positive Z directed up.",
  "SP Length": "2 bytes",
  "Resolution": "1\/1024 rad per bit",
  "Offset": "-31.374 rad",
  "Units": "rad",
  "Data Range" : "-31.374 to +31.374 rad"
 },
 {
  "Otofusion Param ID": 113,
  "PGN": 61449,
  "PG Label": "Vehicle Dynamic Stability Control 2",
  "Multipacket": "No",
  "Transmission Rate": "10 ms",
  "SP Position in PG": "3.1",
  "SPN": 1811,
  "In Data?": 734123,
  "SP Label": "Steering Wheel Turn Counter",
  "SP Description": "Indicates number of steering wheel turns, absolute position or relative position at ignition on. Positive values indicate left turns.",
  "SP Length": "6 bits",
  "Resolution": "1 turn\/bit",
  "Offset": "-32 turns",
  "Units": "turns",
  "Data Range" : "-32 to 29 turns"
 },
 {
  "Otofusion Param ID": 114,
  "PGN": 64777,
  "PG Label": "High Resolution Fuel Consumption (Liquid)",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "5-8",
  "SPN": 5054,
  "In Data?": 29556,
  "SP Label": "Engine Total Fuel Used (High Resolution)",
  "SP Description": "Accumulated amount of fuel used during vehicle operation.  High resolution used for calculations and fleet management systems.  See SPN 250 for alternate resolution.",
  "SP Length": "4 bytes",
  "Resolution": "0.001 l\/bit",
  "Offset": "0",
  "Units": "l",
  "Data Range" : ""
 },
 {
  "Otofusion Param ID": 115,
  "PGN": 64964,
  "PG Label": "Electronic Brake Controller 5",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "1.3",
  "SPN": 2913,
  "In Data?": 605258,
  "SP Label": "Halt brake mode",
  "SP Description": "Signal which indicates the current mode of the halt brake function.\r\n\r\n000b = Inactive\r\n001b = Active\r\n010b = Active, but not functioning properly.  (This mode may be used to warn the driver)\r\n011b to 101b = Not defined\r\n110b = Halt brake not functional\r\n111b = Not available",
  "SP Length": "3 bits",
  "Resolution": "8 states\/3 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range" : ""
 },
 {
  "Otofusion Param ID": 116,
  "PGN": 65132,
  "PG Label": "Tachograph",
  "Multipacket": "No",
  "Transmission Rate": "50 ms",
  "SP Position in PG": "7-8",
  "SPN": 1624,
  "In Data?": 587002,
  "SP Label": "Tachograph vehicle speed",
  "SP Description": "Speed of the vehicle registered by the tachograph.",
  "SP Length": "2 bytes",
  "Resolution": "1\/256 km\/h per bit",
  "Offset": "0",
  "Units": "km\/h",
  "Data Range" : "0 to 250.996 km/h"
 },
 {
  "Otofusion Param ID": 117,
  "PGN": 65135,
  "PG Label": "Adaptive Cruise Control 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms or upon state change but not faster than 20 ms.",
  "SP Position in PG": "2",
  "SPN": 1587,
  "In Data?": 148358,
  "SP Label": "Distance to forward vehicle",
  "SP Description": "Distance to the preceding vehicle situated within 250 m in the same lane and moving in the same direction.\r\n\r\nThe value of FFh indicates that no vehicle is detected.",
  "SP Length": "1 byte",
  "Resolution": "1 m\/bit",
  "Offset": "0",
  "Units": "m",
  "Data Range" : "0 to 250 m"
 },
 {
  "Otofusion Param ID": 118,
  "PGN": 65135,
  "PG Label": "Adaptive Cruise Control 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms or upon state change but not faster than 20 ms.",
  "SP Position in PG": "4.4",
  "SPN": 1589,
  "In Data?": 148358,
  "SP Label": "Adaptive cruise control set distance mode",
  "SP Description": "Selected distance mode for adaptive cruise control. \r\n\r\n000b = ACC Distance mode #1 (largest distance)\r\n001b = ACC Distance mode #2\r\n010b = ACC Distance mode #3\r\n011b = ACC Distance mode #4\r\n100b = ACC Distance mode #5 (shortest distance)\r\n101b = Conventional cruise control mode\r\n110b = Error condition\r\n111b = Not available\/not valid",
  "SP Length": "3 bits",
  "Resolution": "1 8 states\/3 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range" : "options: 0b000 - 0b110"
 },
 {
  "Otofusion Param ID": 119,
  "PGN": 65196,
  "PG Label": "Wheel Brake Lining Remaining Information",
  "Multipacket": "No",
  "Transmission Rate": "On request",
  "SP Position in PG": "1",
  "SPN": 1099,
  "In Data?": 2950,
  "SP Label": "Brake Lining Remaining, Front Axle, Left Wheel",
  "SP Description": "The percentage of brake lining which can still be measured for the left wheel on the front axle.  100% represents new brake linings, 0% represents totally worn brake linings.",
  "SP Length": "1 byte",
  "Resolution": "0.4 %\/bit",
  "Offset": "0",
  "Units": "%",
  "Data Range" : " 0 to 100 %"
 },
 {
  "Otofusion Param ID": 120,
  "PGN": 65196,
  "PG Label": "Wheel Brake Lining Remaining Information",
  "Multipacket": "No",
  "Transmission Rate": "On request",
  "SP Position in PG": "2",
  "SPN": 1100,
  "In Data?": 2950,
  "SP Label": "Brake Lining Remaining, Front Axle, Right Wheel",
  "SP Description": "The percentage of brake lining which can still be measured for the right wheel on the front axle.  100% represents new brake linings, 0% represents totally worn brake linings.",
  "SP Length": "1 byte",
  "Resolution": "0.4 %\/bit",
  "Offset": "0",
  "Units": "%",
  "Data Range" : " 0 to 100 %"
 },
 {
  "Otofusion Param ID": 121,
  "PGN": 65196,
  "PG Label": "Wheel Brake Lining Remaining Information",
  "Multipacket": "No",
  "Transmission Rate": "On request",
  "SP Position in PG": "3",
  "SPN": 1101,
  "In Data?": 2950,
  "SP Label": "Brake Lining Remaining, Rear Axle #1, Left Wheel",
  "SP Description": "The percentage of brake lining which can still be measured for the left wheel on the rear axle #1.  100% represents new brake linings, 0% represents totally worn brake linings.",
  "SP Length": "1 byte",
  "Resolution": "0.4 %\/bit",
  "Offset": "0",
  "Units": "%",
  "Data Range" : " 0 to 100 %"
 },
 {
  "Otofusion Param ID": 122,
  "PGN": 65196,
  "PG Label": "Wheel Brake Lining Remaining Information",
  "Multipacket": "No",
  "Transmission Rate": "On request",
  "SP Position in PG": "4",
  "SPN": 1102,
  "In Data?": 2950,
  "SP Label": "Brake Lining Remaining, Rear Axle #1, Right Wheel",
  "SP Description": "The percentage of brake lining which can still be measured for the right wheel on the rear axle #1.  100% represents new brake linings, 0% represents totally worn brake linings.",
  "SP Length": "1 byte",
  "Resolution": "0.4 %\/bit",
  "Offset": "0",
  "Units": "%",
  "Data Range" : " 0 to 100 %"
 },
 {
  "Otofusion Param ID": 123,
  "PGN": 65217,
  "PG Label": "High Resolution Vehicle Distance",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "1-4",
  "SPN": 917,
  "In Data?": 29350,
  "SP Label": "Total Vehicle Distance (High Resolution)",
  "SP Description": "Accumulated distance traveled by the vehicle during its operation.\r\n\r\nNOTE - See SPN 245 for alternate resolution.",
  "SP Length": "4 bytes",
  "Resolution": "5 m\/bit",
  "Offset": "0",
  "Units": "m",
  "Data Range" : "0 to 21055406 km"
 },
 {
  "Otofusion Param ID": 124,
  "PGN": 65217,
  "PG Label": "High Resolution Vehicle Distance",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "5-8",
  "SPN": 918,
  "In Data?": 29350,
  "SP Label": "Trip Distance (High Resolution)",
  "SP Description": "Distance traveled during all or part of a journey.\r\n\r\nNOTE - See SPN 244 for alternate resolution.",
  "SP Length": "4 bytes",
  "Resolution": "5 m\/bit",
  "Offset": "0",
  "Units": "m",
  "Data Range" : " 0 to 21055406 km"
 },
 {
  "Otofusion Param ID": 125,
  "PGN": 65252,
  "PG Label": "Shutdown",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "5.5",
  "SPN": 1108,
  "In Data?": 29614,
  "SP Label": "Engine Protection System Timer Override",
  "SP Description": "Status signal which indicates the status of the override feature of the engine protection system timer. See Figure SPN1107_A.\r\n\r\n00b = Inactive\r\n01b = Active\r\n10b = Error\r\n11b = Not available",
  "SP Length": "2 bits",
  "Resolution": "1 4 states\/2 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range" : "options: 0b00, 0b01"
 },
 {
  "Otofusion Param ID": 126,
  "PGN": 65252,
  "PG Label": "Shutdown",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "5.7",
  "SPN": 1107,
  "In Data?": 29614,
  "SP Label": "Engine Protection System Timer State",
  "SP Description": "Status signal which indicates the current mode of the engine protection system timer system.  See Figure SPN1107_A.\r\n\r\n00b = Inactive\r\n01b = Active\r\n10b = Error\r\n11b = Not available",
  "SP Length": "2 bits",
  "Resolution": "1 4 states\/2 bit",
  "Offset": "0",
  "Units": "bit",
  "Data Range" : "options: 0b00, 0b01"
 },
 {
  "Otofusion Param ID": 127,
  "PGN": 65257,
  "PG Label": "Fuel Consumption (Liquid) 1",
  "Multipacket": "No",
  "Transmission Rate": "On request",
  "SP Position in PG": "5-8",
  "SPN": 250,
  "In Data?": 29558,
  "SP Label": "Engine Total Fuel Used",
  "SP Description": "Accumulated amount of fuel used during vehicle operation.  See SPN 5054 for alternate resolution.",
  "SP Length": "4 bytes",
  "Resolution": "0.5 l\/bit",
  "Offset": "0",
  "Units": "l",
  "Data Range" : " 0 to 2105540607.5 L"
 },
 {
  "Otofusion Param ID": 128,
  "PGN": 65262,
  "PG Label": "Engine Temperature 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "1",
  "SPN": 110,
  "In Data?": 29556,
  "SP Label": "Engine Coolant Temperature",
  "SP Description": "Temperature of liquid found in engine cooling system.",
  "SP Length": "1 byte",
  "Resolution": "1 °C\/bit",
  "Offset": "-40 °C",
  "Units": "°C",
  "Data Range" : "0 to 100 %"
 },
 {
  "Otofusion Param ID": 129,
  "PGN": 65262,
  "PG Label": "Engine Temperature 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "2",
  "SPN": 174,
  "In Data?": 29556,
  "SP Label": "Engine Fuel 1 Temperature 1",
  "SP Description": "Temperature of fuel (or gas) of the first fuel type. See SPN 3468 for a second temperature measurement of the first fuel type.",
  "SP Length": "1 byte",
  "Resolution": "1 °C\/bit",
  "Offset": "-40 °C",
  "Units": "°C",
  "Data Range" : "273 to 1735 deg C"
 },
 {
  "Otofusion Param ID": 130,
  "PGN": 65262,
  "PG Label": "Engine Temperature 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "3-4",
  "SPN": 175,
  "In Data?": 29556,
  "SP Label": "Engine Oil Temperature 1",
  "SP Description": "Temperature of the engine lubricant.\r\n\r\nNote:  If there is only one engine oil temperature measurement, this SP should be used.  This is the SP that is typically displayed on an on-highway truck instrument cluster.\r\n\r\nSee also SPNs 1135 and 5925 for additional engine oil temperature measurements.",
  "SP Length": "2 bytes",
  "Resolution": "0.03125 °C\/bit",
  "Offset": "-273 °C",
  "Units": "°C",
  "Data Range" : "273 to 1735 deg C"
 },
 {
  "Otofusion Param ID": 131,
  "PGN": 65265,
  "PG Label": "Cruise Control\/Vehicle Speed 1",
  "Multipacket": "No",
  "Transmission Rate": "100 ms",
  "SP Position in PG": "2-3",
  "SPN": 84,
  "In Data?": 296716,
  "SP Label": "Wheel-Based Vehicle Speed",
  "SP Description": "Speed of the vehicle as calculated from wheel or tailshaft speed.",
  "SP Length": "2 bytes",
  "Resolution": "1\/256 km\/h per bit",
  "Offset": "0",
  "Units": "km\/h",
  "Data Range" : "0 to 250.996 km/h"
 },
 {
  "Otofusion Param ID": 132,
  "PGN": 65272,
  "PG Label": "Transmission Fluids 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "5-6",
  "SPN": 177,
  "In Data?": 29364,
  "SP Label": "Transmission Oil Temperature 1",
  "SP Description": "First instance of transmission lubricant temperature.",
  "SP Length": "2 bytes",
  "Resolution": "0.03125 °C\/bit",
  "Offset": "-273 °C",
  "Units": "°C",
  "Data Range": "-273 to 1735 °C"
 },
 {
  "Otofusion Param ID": 133,
  "PGN": 65276,
  "PG Label": "Dash Display 1",
  "Multipacket": "No",
  "Transmission Rate": "1 s",
  "SP Position in PG": "2",
  "SPN": 96,
  "In Data?": 35531,
  "SP Label": "Fuel Level 1",
  "SP Description": "Ratio of volume of fuel to the total volume of fuel storage container.\r\n\r\nWhen Fuel Level 2 (SPN 38) is not used, Fuel Level 1 represents the total fuel in all fuel storage containers.  When Fuel Level 2 is used, Fuel Level 1 represents the fuel level in the primary or left-side fuel storage container.",
  "SP Length": "1 byte",
  "Resolution": "0.4 %\/bit",
  "Offset": "0",
  "Units": "%",
  "Data Range" : " 0 to 100 %"
 }
]}
